docs/usage.org
#+TITLE: Usage

#+begin_quote
Packaging your site with safesurfer/go-http-server
#+end_quote

* Container build

** Simple
#+begin_src dockerfile
FROM registry.gitlab.com/safesurfer/go-http-server:1.0.0
COPY site /app/site
#+end_src

** Simple + headers
#+begin_src dockerfile
FROM registry.gitlab.com/safesurfer/go-http-server:1.0.0
env APP_HEADER_SET_ENABLE=true \
  APP_HEADER_MAP_PATH=./headers.yaml
COPY site /app/site
COPY headers.yaml /app/headers.yaml
#+end_src

** Vuejs
#+begin_src dockerfile
FROM registry.gitlab.com/safesurfer/go-http-server:1.0.0
env APP_VUEJS_HISTORY_MODE=true
COPY dist /app/dist
#+end_src

** Vuejs + template map
  #+begin_src dockerfile
FROM registry.gitlab.com/safesurfer/go-http-server:1.0.0
env APP_SERVE_FOLDER=./dist \
  APP_VUEJS_HISTORY_MODE=true \
  APP_TEMPLATE_MAP_PATH=/app/map.yaml
COPY dist /app/dist
COPY templatemap.yaml /app/map.yaml
#+end_src

** Vuejs + template map + headers
  #+begin_src dockerfile
FROM registry.gitlab.com/safesurfer/go-http-server:1.0.0
env APP_SERVE_FOLDER=./dist \
  APP_VUEJS_HISTORY_MODE=true \
  APP_TEMPLATE_MAP_PATH=/app/map.yaml \
  APP_HEADER_SET_ENABLE=true \
  APP_HEADER_MAP_PATH=./headers.yaml
COPY dist /app/dist
COPY headers.yaml /app/headers.yaml
COPY templatemap.yaml /app/map.yaml
#+end_src
